In [1]:
import pandas as pd
import numpy as np

In [2]:
groceries=pd.Series(data=[26,39,"yes","no"],index=["milk","bread","egg","apple"])
groceries

milk      26
bread     39
egg      yes
apple     no
dtype: object

In [3]:
groceries.shape

(4,)

In [4]:
groceries.size

4

In [5]:
groceries.ndim

1

In [6]:
groceries.values

array([26, 39, 'yes', 'no'], dtype=object)

In [7]:
"egg" in groceries

True

In [8]:
groceries["egg"]

'yes'

In [9]:
groceries[[0,1]]

milk     26
bread    39
dtype: object

In [10]:
groceries.loc[["bread","apple"]]

bread    39
apple    no
dtype: object

In [11]:
groceries.iloc[[1,2]]

bread     39
egg      yes
dtype: object

In [12]:
groceries

milk      26
bread     39
egg      yes
apple     no
dtype: object

In [13]:
groceries["egg"]=2
groceries

milk     26
bread    39
egg       2
apple    no
dtype: object

In [14]:
groceries

milk     26
bread    39
egg       2
apple    no
dtype: object

In [15]:
groceries["apple"]=2

#Arithmetic operation in pandas

In [16]:
groceries

milk     26
bread    39
egg       2
apple     2
dtype: object

In [17]:
groceries + 2

milk     28
bread    41
egg       4
apple     4
dtype: object

In [18]:
groceries - 2

milk     24
bread    37
egg       0
apple     0
dtype: object

In [19]:
groceries *2

milk     52
bread    78
egg       4
apple     4
dtype: object

In [20]:
groceries

milk     26
bread    39
egg       2
apple     2
dtype: object

In [21]:
np.power(groceries,2)

milk      676
bread    1521
egg         4
apple       4
dtype: object

In [22]:
groceries["apple"]+2

4

In [23]:
groceries.iloc[0]-2

24

In [24]:
groceries.loc["apple"]*4

8

#Data Frame in Pandas

In [25]:
items={"Bob":pd.Series(data=[155,36,89,45],index=["Watch","Cookies","Bread","Milk"]),
       "Alex":pd.Series(data=[180,50,75,30],index=["Watch","Cookies","Bread","Milk"])}
print(type(items))

<class 'dict'>

In [26]:
Shopping_carts=pd.DataFrame(items)
Shopping_carts

         Bob  Alex
Watch    155   180
Cookies   36    50
Bread     89    75
Milk      45    30

In [27]:
Shopping_carts.shape

(4, 2)

In [28]:
Shopping_carts.columns

Index(['Bob', 'Alex'], dtype='object')

In [29]:
Shopping_carts.values

array([[155, 180],
       [ 36,  50],
       [ 89,  75],
       [ 45,  30]], dtype=int64)

In [30]:
Shopping_carts.index

Index(['Watch', 'Cookies', 'Bread', 'Milk'], dtype='object')

In [31]:
Bob_Shopping_cart=pd.DataFrame(items,columns=["Bob"])
Bob_Shopping_cart

         Bob
Watch    155
Cookies   36
Bread     89
Milk      45

In [32]:
Alex_Shopping_carts=pd.DataFrame(items,columns=["Alex"])
Alex_Shopping_carts

         Alex
Watch     180
Cookies    50
Bread      75
Milk       30

In [33]:
Alex_carts=pd.DataFrame(items,index=["Cookies","Milk"],columns=["Alex"])
Alex_carts

         Alex
Cookies    50
Milk       30

In [34]:
Data={"integer":[22,44,55],"Float":[22.0,33.0,44.0]}

In [35]:
new_data=pd.DataFrame(Data,index=("label 1","label 2","label 3"))
new_data

         integer  Float
label 1       22   22.0
label 2       44   33.0
label 3       55   44.0

Accessing Elements in Pandas DataFrame

In [36]:
items=[{"bikes":15,"glasses":25,"pants":10},{"bikes":18,"pants":15,"glasses":30}]
store_items=pd.DataFrame(items,index=["store 1","store 2"])
store_items

         bikes  glasses  pants
store 1     15       25     10
store 2     18       30     15

In [37]:
store_items["shirt"]=[15,8]
store_items

         bikes  glasses  pants  shirt
store 1     15       25     10     15
store 2     18       30     15      8

In [38]:
store_items["suits"]=store_items["shirt"]+store_items["pants"]
store_items

         bikes  glasses  pants  shirt  suits
store 1     15       25     10     15     25
store 2     18       30     15      8     23

Add another index store 3

In [39]:
new_items=[{"bikes":20,"glasses":20,"pants":25}]
new_store=pd.DataFrame(new_items,index=["store 3"])
new_store

         bikes  glasses  pants
store 3     20       20     25

In [44]:
stored_items=pd.concat([store_items,new_store])
stored_items

         bikes  glasses  pants  shirt  suits
store 1     15       25     10   15.0   25.0
store 2     18       30     15    8.0   23.0
store 3     20       20     25    NaN    NaN

In [49]:
#pop
stored_items.pop("glasses")

store 1    25
store 2    30
store 3    20
Name: glasses, dtype: int64

In [52]:
stored_items["new_pants"]=stored_items["pants"][1:]
stored_items

         bikes  pants  shirt  suits  new_pants
store 1     15     10   15.0   25.0        NaN
store 2     18     15    8.0   23.0       15.0
store 3     20     25    NaN    NaN       25.0

In [54]:
#drop:use to delete row as well as columns 
stored_items.drop(["new_pants","suits"],axis=1)
stored_items

         bikes  pants  shirt  suits  new_pants
store 1     15     10   15.0   25.0        NaN
store 2     18     15    8.0   23.0       15.0
store 3     20     25    NaN    NaN       25.0

In [57]:
#rename:rename the column bikes into cars
stored_items.rename(columns={"bikes":"cars"})

         cars  pants  shirt  suits  new_pants
store 1    15     10   15.0   25.0        NaN
store 2    18     15    8.0   23.0       15.0
store 3    20     25    NaN    NaN       25.0

Dealing NaN values

In [58]:
stored_items

         bikes  pants  shirt  suits  new_pants
store 1     15     10   15.0   25.0        NaN
store 2     18     15    8.0   23.0       15.0
store 3     20     25    NaN    NaN       25.0

In [60]:
#is null() : used to find whether the value is null or not
stored_items.isnull()

         bikes  pants  shirt  suits  new_pants
store 1  False  False  False  False       True
store 2  False  False  False  False      False
store 3  False  False   True   True      False

In [62]:
stored_items.isnull().sum().sum()

3

In [63]:
#count :count of values
stored_items.count()

bikes        3
pants        3
shirt        2
suits        2
new_pants    2
dtype: int64

In [64]:
#dropna : used to drop Nan column
stored_items.dropna(axis=0)

         bikes  pants  shirt  suits  new_pants
store 2     18     15    8.0   23.0       15.0

In [65]:
stored_items.dropna(axis=1)

         bikes  pants
store 1     15     10
store 2     18     15
store 3     20     25

In [66]:
#fillna : used to fill Nan value to integer
stored_items.fillna(0)

         bikes  pants  shirt  suits  new_pants
store 1     15     10   15.0   25.0        0.0
store 2     18     15    8.0   23.0       15.0
store 3     20     25    0.0    0.0       25.0

In [67]:
#fillna method=forwardfilling used to fill na value with previous forward value
stored_items.fillna(method="ffill",axis=0)

         bikes  pants  shirt  suits  new_pants
store 1     15     10   15.0   25.0        NaN
store 2     18     15    8.0   23.0       15.0
store 3     20     25    8.0   23.0       25.0

In [68]:
stored_items.fillna(method="ffill",axis=1)

         bikes  pants  shirt  suits  new_pants
store 1   15.0   10.0   15.0   25.0       25.0
store 2   18.0   15.0    8.0   23.0       15.0
store 3   20.0   25.0   25.0   25.0       25.0

In [69]:
#fillna method=backwardfilling used to fill na value backward value
stored_items.fillna(method="backfill",axis=0)

         bikes  pants  shirt  suits  new_pants
store 1     15     10   15.0   25.0       15.0
store 2     18     15    8.0   23.0       15.0
store 3     20     25    NaN    NaN       25.0

In [70]:
stored_items.fillna(method="backfill",axis=1)

         bikes  pants  shirt  suits  new_pants
store 1   15.0   10.0   15.0   25.0        NaN
store 2   18.0   15.0    8.0   23.0       15.0
store 3   20.0   25.0   25.0   25.0       25.0

In [71]:
#interpolate
stored_items.interpolate(method="linear",axis=0)

         bikes  pants  shirt  suits  new_pants
store 1     15     10   15.0   25.0        NaN
store 2     18     15    8.0   23.0       15.0
store 3     20     25    8.0   23.0       25.0

In [72]:
stored_items.interpolate(method="linear",axis=1)

         bikes  pants  shirt  suits  new_pants
store 1   15.0   10.0   15.0   25.0       25.0
store 2   18.0   15.0    8.0   23.0       15.0
store 3   20.0   25.0   25.0   25.0       25.0

In [79]:
stored_items.fillna(method="pad",axis=1)

         bikes  pants  shirt  suits  new_pants
store 1   15.0   10.0   15.0   25.0       25.0
store 2   18.0   15.0    8.0   23.0       15.0
store 3   20.0   25.0   25.0   25.0       25.0

Loading data into a pandas

In [83]:
company=pd.read_csv("./fake-company.csv")

In [84]:
company.shape

(9, 5)

In [85]:
company.head(5)

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000

In [87]:
company.tail(5)

   Year     Name Department  Age  Salary
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [88]:
company.describe()

              Year        Age        Salary
count     9.000000   9.000000      9.000000
mean   1991.000000  32.222222  54333.333333
std       0.866025   7.870479   5147.815070
min    1990.000000  25.000000  48000.000000
25%    1990.000000  27.000000  50000.000000
50%    1991.000000  30.000000  52000.000000
75%    1992.000000  32.000000  60000.000000
max    1992.000000  46.000000  62000.000000

In [89]:
company.isnull().any()

Year          False
Name          False
Department    False
Age           False
Salary        False
dtype: bool

In [90]:
company.max()

Year           1992
Name          Inaar
Department       RD
Age              46
Salary        62000
dtype: object

In [91]:
company.min()

Year           1990
Name          Alice
Department    Admin
Age              25
Salary        48000
dtype: object

In [96]:
company.groupby(["Year"])["Salary"].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [98]:
company.groupby(["Year"])["Salary"].mean()

Year
1990    51000.0
1991    54000.0
1992    58000.0
Name: Salary, dtype: float64

In [104]:
company.groupby(['Year', 'Department'])['Salary'].sum()

Year  Age
1990  25     50000
      30     48000
      45     55000
1991  26     52000
      31     50000
      46     60000
1992  27     60000
      28     62000
      32     52000
Name: Salary, dtype: int64